{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.7.0", "signature": {"inputs": {"args_0_46:0": {"name": "args_0_46:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_23:0": {"name": "args_0_23:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_21:0": {"name": "args_0_21:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_6:0": {"name": "args_0_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_34:0": {"name": "args_0_34:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_50:0": {"name": "args_0_50:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_31:0": {"name": "args_0_31:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_29:0": {"name": "args_0_29:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_22:0": {"name": "args_0_22:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_48:0": {"name": "args_0_48:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_40:0": {"name": "args_0_40:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_25:0": {"name": "args_0_25:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_14:0": {"name": "args_0_14:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_16:0": {"name": "args_0_16:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_17:0": {"name": "args_0_17:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_15:0": {"name": "args_0_15:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_30:0": {"name": "args_0_30:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_44:0": {"name": "args_0_44:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_42:0": {"name": "args_0_42:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_27:0": {"name": "args_0_27:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_33:0": {"name": "args_0_33:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_11:0": {"name": "args_0_11:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_43:0": {"name": "args_0_43:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_20:0": {"name": "args_0_20:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_13:0": {"name": "args_0_13:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_10:0": {"name": "args_0_10:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_37:0": {"name": "args_0_37:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_9:0": {"name": "args_0_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_28:0": {"name": "args_0_28:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_32:0": {"name": "args_0_32:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_26:0": {"name": "args_0_26:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_49:0": {"name": "args_0_49:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_39:0": {"name": "args_0_39:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_8:0": {"name": "args_0_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_3:0": {"name": "args_0_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_41:0": {"name": "args_0_41:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_1:0": {"name": "args_0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_45:0": {"name": "args_0_45:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_4:0": {"name": "args_0_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_35:0": {"name": "args_0_35:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_12:0": {"name": "args_0_12:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_36:0": {"name": "args_0_36:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_47:0": {"name": "args_0_47:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "gradient_boosted_trees_model_1/1895:0": {"name": "gradient_boosted_trees_model_1/1895:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1698}, "args_0_7:0": {"name": "args_0_7:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_5:0": {"name": "args_0_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_2:0": {"name": "args_0_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_24:0": {"name": "args_0_24:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_19:0": {"name": "args_0_19:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_18:0": {"name": "args_0_18:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_38:0": {"name": "args_0_38:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_10", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_11", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_12", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_13", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_14", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_15", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_16", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_17", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_18", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_19", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_20", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_21", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_22", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_23", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_24", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_25", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_26", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_27", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_28", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_29", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_30", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_31", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_32", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_33", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_34", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_35", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_36", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_37", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_38", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_39", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_4", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_40", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_41", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_42", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_43", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_44", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_45", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_46", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_47", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_48", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_49", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_50", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_6", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_7", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0_8", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_9", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_1/1895", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54", "op": "NoOp", "input": ["^args_0_34", "^args_0_18", "^args_0_5", "^args_0_2", "^args_0_10", "^args_0_50", "^args_0_19", "^args_0_27", "^args_0_16", "^args_0_13", "^args_0_43", "^args_0_14", "^args_0_47", "^args_0_37", "^args_0_22", "^args_0_29", "^args_0_42", "^args_0_49", "^args_0_1", "^args_0_35", "^args_0_41", "^args_0_46", "^args_0_15", "^args_0_28", "^args_0_45", "^args_0_44", "^args_0_11", "^args_0_48", "^args_0_32", "^args_0_31", "^args_0_12", "^args_0_26", "^args_0_24", "^args_0_7", "^args_0_17", "^args_0", "^args_0_38", "^args_0_33", "^args_0_21", "^args_0_36", "^args_0_25", "^args_0_30", "^args_0_8", "^args_0_6", "^args_0_4", "^args_0_9", "^args_0_40", "^gradient_boosted_trees_model_1/1895", "^args_0_3", "^args_0_39", "^args_0_20", "^args_0_23"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_1", "op": "Cast", "input": ["args_0_32", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_2", "op": "Cast", "input": ["args_0_31", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_3", "op": "Cast", "input": ["args_0_12", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["args_0_26", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_4", "op": "Cast", "input": ["args_0_24", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_5", "op": "Cast", "input": ["args_0_7", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_6", "op": "Cast", "input": ["args_0", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_7", "op": "Cast", "input": ["args_0_38", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_8", "op": "Cast", "input": ["args_0_33", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_9", "op": "Cast", "input": ["args_0_21", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_10", "op": "Cast", "input": ["args_0_36", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_11", "op": "Cast", "input": ["args_0_25", "^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_54"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stack", "op": "Pack", "input": ["args_0_34", "args_0_18", "args_0_47", "args_0_28", "args_0_17", "args_0_9", "args_0_3", "args_0_39", "args_0_20", "args_0_23", "args_0_5", "args_0_2", "args_0_10", "args_0_50", "args_0_19", "args_0_27", "args_0_16", "args_0_13", "args_0_43", "args_0_14", "args_0_37", "args_0_22", "args_0_29", "args_0_42", "args_0_49", "args_0_1", "args_0_35", "args_0_41", "args_0_46", "args_0_15", "args_0_45", "args_0_44", "args_0_11", "args_0_48", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_1", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_2", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_3", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_4", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_5", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_6", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_7", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_8", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_9", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_10", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast_11", "args_0_30", "args_0_8", "args_0_6", "args_0_4", "args_0_40"], "attr": {"axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "51"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/stack", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "gradient_boosted_trees_model_1/1895"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "2"}}}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice", "op": "StridedSlice", "input": ["gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/inference_op", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "2590", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"container": {"s": ""}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzc5ZGMwZGY0LTE4ODMtNGZhYi1iYTRiLTQyNmZjYzhmMzllOV9sb2FkXzkx"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^2590", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["2590", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"rewrite": {"s": ""}, "pattern": {"s": "ZTZkZjExYmY3MzA5NDVmOGRvbmU="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"_has_manual_control_dependencies": {"b": true}, "file_prefix": {"s": "ZTZkZjExYmY3MzA5NDVmOA=="}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_acd_function_control_output": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1395}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1698}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "gradient_boosted_trees_model_1/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "2590", "shape": [], "dtype": "string"}]}]}